person = 5
result = []
cook_book = [
  ['Салат',
      [
        ['картофель', 100, 'гр.'],
        ['морковь', 50, 'гр.'],
        ['огурцы', 50, 'гр.'],
        ['горошек', 30, 'гр.'],
        ['майонез', 70, 'мл.'],
      ]
  ],
  ['Пицца',  
      [
        ['сыр', 50, 'гр.'],
        ['томаты', 50, 'гр.'],
        ['тесто', 100, 'гр.'],
        ['бекон', 30, 'гр.'],
        ['колбаса', 30, 'гр.'],
        ['грибы', 20, 'гр.'],
      ],
  ],
  ['Фруктовый десерт',
      [
        ['хурма', 60, 'гр.'],
        ['киви', 60, 'гр.'],
        ['творог', 60, 'гр.'],
        ['сахар', 10, 'гр.'],
        ['мед', 50, 'мл.'],  
      ]
  ]
]

counter = 0
index_list = 0
list_1 = []
list_2 = []
for dish,ingredients in cook_book:
    index_list += 1
    print(index_list)
    print(dish)
    list_1.append(dish +':')
    for ingredient, weight, grams in ingredients:
        weight = weight * 5
        print(ingredient, weight, grams, end='')
        
print()        
print(list_1) 
    
"""
Результат должен быть такой.
    assert result == ['Салат: картофель 500 гр., морковь 250 гр., огурцы 250 гр., горошек 150 гр., майонез 350 мл.',
                      'Пицца: сыр 250 гр., томаты 250 гр., тесто 500 гр., бекон 150 гр., колбаса 150 гр., грибы 100 гр.',
                      'Фруктовый десерт: хурма 300 гр., киви 300 гр., творог 300 гр., сахар 50 гр., мед 250 мл.']
                      
['Салат: картофель 500 гр., морковь 250 гр., огурцы 250 гр., горошек 150 гр., майонез 350 мл.',
'Пицца: сыр 250 гр., томаты 250 гр., тесто 500 гр., бекон 150 гр., колбаса 150 гр., грибы 100 гр.',
'Фруктовый десерт: хурма 300 гр., киви 300 гр., творог 300 гр., сахар 50 гр., мед 250 мл.']

    for dish, ingredients in cook_book:
        new_ingredients = ''
        for ingredient, weight, grams in ingredients:
            weight = weight * 5
            new_ingredients += f'{ingredient} {weight} {grams}, '
        new_ingredients = new_ingredients[:-2]
        result.append(f'{dish}: {new_ingredients}')
    return result



Результат
Список покупок на 5 персон: ['Салат: картофель 500 гр., морковь 250 гр., огурцы 250 гр., горошек 150 гр., майонез 350 мл.', 'Пицца: сыр 250 гр., томаты 250 гр., тесто 500 гр., бекон 150 гр., колбаса 150 гр., грибы 100 гр.', 'Фруктовый десерт: хурма 300 гр., киви 300 гр., творог 300 гр., сахар 50 гр., мед 250 мл.']


def test_passed():
        assert main.solve(cook_book, 5) == [
            'Салат: картофель 500 гр., морковь 250 гр., огурцы 250 гр., горошек 150 гр., майонез 350 мл.',
            'Пицца: сыр 250 гр., томаты 250 гр., тесто 500 гр., бекон 150 гр., колбаса 150 гр., грибы 100 гр.',
            'Фруктовый десерт: хурма 300 гр., киви 300 гр., творог 300 гр., сахар 50 гр., мед 250 мл.']
>       assert main.solve(cook_book, 6) == [
            'Салат: картофель 600 гр., морковь 300 гр., огурцы 300 гр., горошек 180 гр., '
            'майонез 420 мл.',
            'Пицца: сыр 300 гр., томаты 300 гр., тесто 600 гр., бекон 180 гр., колбаса '
            '180 гр., грибы 120 гр.',
            'Фруктовый десерт: хурма 360 гр., киви 360 гр., творог 360 гр., сахар 60 гр., '
            'мед 300 мл.']
E       AssertionError: assert ['Салат: карт... мед 250 мл.'] == ['Салат: карт... мед 300 мл.']
E         At index 0 diff: 'Салат: картофель 500 гр., морковь 250 гр., огурцы 250 гр., горошек 150 гр., майонез 350 мл.' != 'Салат: картофель 600 гр., морковь 300 гр., огурцы 300 гр., горошек 180 гр., майонез 420 мл.'
E         Use -v to get more diff

test_main.py:40: AssertionError
=========================== short test summary info ============================
FAILED test_main.py::test_passed - AssertionError: assert ['Салат: карт... ме...
============================== 1 failed in 0.03s ===============================

"""