"""
На курсе Java-разработчик с нуля есть тёзки: Иван Бочаров, Иван Маркитан, Максим Батырев, Максим Воронцов, Сергей Индюков, Сергей Сердюк
На курсе Fullstack-разработчик на Python есть тёзки: Александр Бардин, Александр Иванов, Александр Ульянцев, Александр Шлейко, Евгений Шек, Евгений Шмаргунов
На курсе Python-разработчик с нуля есть тёзки: Александр Бардин, Александр Иванов, Александр Ульянцев
На курсе Frontend-разработчик с нуля есть тёзки: Александр Беспоясов, Александр Фитискин, Александр Шлейко
"""
courses = [
    "Java-разработчик с нуля", "Fullstack-разработчик на Python",
    "Python-разработчик с нуля", "Frontend-разработчик с нуля"
]
mentors = [[
    "Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков",
    "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков",
    "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский",
    "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков",
    "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен",
    "Сергей Сердюк", "Павел Дерендяев"
],
           [
               "Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин",
               "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев",
               "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко",
               "Алена Батицкая", "Денис Ежков", "Владимир Чебукин",
               "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко",
               "Елена Никитина"
           ],
           [
               "Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов",
               "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин",
               "Александр Иванов", "Антон Солонилин", "Максим Филипенко",
               "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"
           ],
           [
               "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек",
               "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
               "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов",
               "Денис Ежков", "Николай Лопин", "Михаил Ларченко"
           ]]
durations = [14, 20, 12, 20]

courses_list = []
for course, mentor, duration in zip(courses, mentors, durations):
  course_dict = {"title": course, "mentors": mentor, "duration": duration}
  courses_list.append(course_dict)

#the_same_names = [] #список имен и фамилий преподавателей встречающиеся больше 1 раза.
for course in courses_list:
    names = [] #список имен учителей
    for fio in course["mentors"]:
        name,surname = fio.split(" ")
        name.strip()
        names.append(name)        
    unique_names = sorted(list(set(names)))
    the_same_names = []
    for unique_name in unique_names:
        counter_name = names.count(unique_name)
        if counter_name > 1:
          for fio in course["mentors"]:
             if unique_name == fio.split(" ")[0]:
                the_same_names.append(fio)
    the_same_names = sorted(list(set(the_same_names)))
    if len(the_same_names) > 1:
        print('На курсе', course["title"], 'есть тёзки:', ", ".join(sorted(the_same_names)))
