# -*- coding: utf-8 -*-
courses = [
  "Java-разработчик с нуля", "Fullstack-разработчик на Python",
  "Python-разработчик с нуля", "Frontend-разработчик с нуля"
]
mentors = [[
  "Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков",
  "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков",
  "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский",
  "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков",
  "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен",
  "Сергей Сердюк", "Павел Дерендяев"
],
           [
             "Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин",
             "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев",
             "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко",
             "Алена Батицкая", "Денис Ежков", "Владимир Чебукин",
             "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко",
             "Елена Никитина"
           ],
           [
             "Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов",
             "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин",
             "Александр Иванов", "Антон Солонилин", "Максим Филипенко",
             "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"
           ],
           [
             "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек",
             "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
             "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов",
             "Денис Ежков", "Николай Лопин", "Михаил Ларченко"
           ]]
durations = [14, 20, 12, 20]

courses_list = []
for course, mentor, duration in zip(courses, mentors, durations):
  course_dict = {"title": course, "mentors": mentor, "duration": duration}
  courses_list.append(course_dict)

names = []
for course in courses_list:
  # самостоятельно напишите код, который создает множество уникальных имен без фамилий
  # Подсказка: вам нужно вспомнить и повторить код из Задания 1 по Множествам
  # результат (уникальные имена без фамилий) запишите в переменную под названием unique_names, преобразуйте в список и отсортируйте по возрастанию
  # это нужно, чтобы ваша программа всегда давала один и тот же результат и тренажер смог его сверить
  # unique_names = ...
  for name in course['mentors']:
    names.append(name.split()[0])
  unique_names = sorted(list(set(names)))
  same_name_list = []

  for uname in unique_names:
    count = 0
    for gname in course['mentors']:
      if uname in gname:
        count += 1
        if count > 1 and uname not in same_name_list:
          same_name_list.append(uname)
  # print(same_name_list)

  same_name_list_res = []
  for i in same_name_list:
    for j in course['mentors']:
      if i in j:
        same_name_list_res.append(j)
  # print(same_name_list_res)
  same_name_list_res = sorted(same_name_list_res) #БЕЗ ЭТОЙ ПРОВЕРКИ ТРЕНАЖЕР НЕ ПРИНИМАЕТ РЕЗУЛЬТАТ
  if same_name_list_res != []:
    # print(f'На курсе {course['title']} есть тёзки: {same_name_list_res}')
    title = course['title']
    res = ', '.join(same_name_list_res)
    #print(f'На курсе {title} есть тёзки: {res}')
     print('На курсе', course['title'], 'есть тёзки:', res)