# -*- coding: utf-8 -*-
courses = ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля", "Frontend-разработчик с нуля"]
mentors = [
	["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
	["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
	["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
	["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин", "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]
durations = [14, 20, 12, 20]

courses_list = []        #каждый курс должен быть словарем.

for course, mentors_list, duration in zip(courses,mentors,durations):
    courses_list.append({"title":course,"mentors":mentors_list,"duration":duration})

min_ = min(durations)
max_ = max(durations)

maxes = []
minis = []
for idx,duration in enumerate(durations):
    if max_ == duration:
        maxes.append(idx)
    elif min_ == duration:
        minis.append(idx)

courses_min = []
courses_max = []

for index_min in minis:
    courses_min.append(courses_list[index_min]["title"])
for index_max in maxes:
    courses_max.append(courses_list[index_max]["title"])

courses_min_str = ", ".join(courses_min)
courses_max_str = ", ".join(courses_max)

print('Самый короткий курс(ы):', courses_min_str, '-', min_,'месяца(ев)')
print('Самый длинный курс(ы):', courses_max_str, '-', max_,'месяца(ев)') 

