# -*- coding: utf-8 -*-
"""
1. Написать функцию для нахождения корней.
ax ** 2 + bx + c = 0
2. Написать функцию для нахождения дескриминанта.
    Если дискриминант < 0, то вывести «корней нет».
    Если дискриминант = 0, то вывести один корень.
    Если дискриминант > 0, то вывести два различных корня.

Параметры для функции.
    a = 1, b = 8, c = 15.
    a = 1, b = -13, c = 12.
    a = -4, b = 28, c = -49.
    a = 1, b = 1, c = 1.
Правельный вывод:
-3.0 -5.0
12.0 1.0
3.5
корней нет
"""
#from math import sqrt

def discriminant(a, b, c):
    d = b ** 2 - 4 * a * c
    return d

def solution(a, b, c):
    d = discriminant(a, b, c)
    if d > 0:
        #x1 = round(((-b + sqrt(d)) / (2 * a)),1)
        #x2 = round(((-b - sqrt(d)) / (2 * a)),1)
        x1 = (-b + d ** 0.5) / (2 * a)
        x2 = (-b - d ** 0.5 ) /(2 * a)
        print(x1,x2)
    elif d == 0:
        x1 = round(-b / (2 * a),1)
        print(x1)
    else:
        print('Нет корней')

solution(1, 8, 15)
solution(1,-13, 12)
solution(-4, 28 ,-49)
solution(1, 1, 1)

"""
Мой ответ:
-7.0 -9.0
18.5 7.5
3.5
Нет корней

#типо правельный ответ
-3.0 -5.0
12.0 1.0
3.5
Корней нет

"""